Функция ПолучитьСписокТестов(Тесты) Экспорт

	СписокТестов = Новый Массив;
	СписокТестов.Добавить("ТестДолжен_ПрочитатьФикстуруИзСоседнегоКаталога");

	Возврат СписокТестов;

КонецФункции

Процедура ТестДолжен_ПрочитатьФикстуруИзСоседнегоКаталога() Экспорт

	КаталогИсходников = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "../src"));

	Попытка
		Чтение = Новый ЧтениеТекста;
		Чтение.Открыть(ОбъединитьПути(КаталогИсходников.ПолноеИмя, "parent-relative-working-directory.txt"));
		Чтение.Закрыть();
	Исключение
		ВызватьИсключение "Тестовая ошибка";
	КонецПопытки;

КонецПроцедуры
