Процедура ТестДолжен_ЗафиксироватьИсключениеЧерезПопытку() Экспорт

	Попытка
		ВызватьИсключение "Ошибка чтения";
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ТестДолжен_ЗафиксироватьПроброшенноеИсключение() Экспорт

	Попытка
		ВызватьИсключение "Ошибка записи";
	Исключение
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ТестДолжен_РазличатьВложенныеПопытки() Экспорт

	Попытка
		Попытка
			ВызватьИсключение "Вложенная ошибка";
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	Исключение
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Попытка

	Сообщить("Это не исполняемый тест");

Исключение
	Сообщить(ОписаниеОшибки());
КонецПопытки;

Процедура ТестДолжен_ЗафиксироватьИсключениеЧерезОжидание() Экспорт

	Ожидаем.Что(
		Новый ТестовыйОбъект()
	).Метод("Открыть").ВыбрасываетИсключение("Ошибка открытия");

КонецПроцедуры
