&Опция(Имя = "engine-root", Описание = "Каталог исходников OneScript")
Перем КаталогИсходников;

&Опция(Имя = "output-file", Описание = "Путь к JSON-отчету")
Перем ПутьКОтчету;

#Область ОбработчикиСобытий

&СкрытьВСправке
&ПодкомандаПриложения(Имя = "external-boundaries", Описание = "Формирует отчет внешних границ")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&ВыполнениеКоманды
Процедура СформироватьОтчет() Экспорт

	КаталогПроб = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "../..")).ПолноеИмя;
	Анализатор = Новый АнализаторВнешнихГраниц;
	Анализатор.Сформировать(КаталогПроб, КаталогИсходников, ПутьКОтчету);

КонецПроцедуры

#КонецОбласти
