&Опция(Имя = "engine-root e", Описание = "Каталог исходников OneScript")
Перем КаталогИсходников;

&Опция(Имя = "oscript-path o", Описание = "Путь к исполняемому файлу OneScript")
Перем ПутьКOneScript;

#Область ОбработчикиСобытий

&ПодкомандаПриложения(Имя = "refresh-runtime rr", Описание = "Обновляет runtime-отчеты")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&ВыполнениеКоманды
Процедура ОбновитьRuntime() Экспорт

	Если ПустаяСтрока(ПутьКOneScript) Тогда
		ВызватьИсключение "Для data refresh-runtime укажите --oscript-path";
	КонецЕсли;

	ПутьКOneScript = Новый Файл(ПутьКOneScript).ПолноеИмя;
	ФайлOneScript = Новый Файл(ПутьКOneScript);

	Если Не ФайлOneScript.Существует() Или ФайлOneScript.ЭтоКаталог() Тогда
		ВызватьИсключение "Не найден исполняемый файл OneScript: " + ПутьКOneScript;
	КонецЕсли;

	КаталогПроб = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "../..")).ПолноеИмя;

	Если ПустаяСтрока(КаталогИсходников) Тогда
		КаталогИсходников = Новый Файл(ОбъединитьПути(КаталогПроб, "../../OneScript")).ПолноеИмя;
	Иначе
		КаталогИсходников = Новый Файл(КаталогИсходников).ПолноеИмя;
	КонецЕсли;
	
	Если Не Новый Файл(КаталогИсходников).Существует() Тогда
		ВызватьИсключение "Не найдены исходники OneScript: " + КаталогИсходников;
	КонецЕсли;

	Обновление = Новый ОбновлениеRuntimeДанныхПроб;
	Обновление.Обновить(КаталогПроб, КаталогИсходников, ПутьКOneScript);

КонецПроцедуры

#КонецОбласти
