#Использовать 1commands

#Область ОбработчикиСобытий

&КомандаПриложения(Имя = "test t", Описание = "Запускает тесты инструментов probes")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&ВыполнениеКоманды
Процедура ЗапуститьТесты() Экспорт

	КаталогПроб = Новый Файл(ОбъединитьПути(ТекущийСценарий().Каталог, "../..")).ПолноеИмя;
	КаталогПроекта = Новый Файл(ОбъединитьПути(КаталогПроб, "..")).ПолноеИмя;
	ФайлыТестов = НайтиФайлы(ОбъединитьПути(КаталогПроб, "tests"), "Тесты*.os");

	Для Каждого ФайлТеста Из ФайлыТестов Цикл
		Сообщить("Запуск " + ФайлТеста.Имя);

		ВнешняяКоманда = Новый Команда;
		ВнешняяКоманда.УстановитьКоманду("oneunit");
		ВнешняяКоманда.ДобавитьПараметр("execute");
		ВнешняяКоманда.ДобавитьПараметр("-f");
		ВнешняяКоманда.ДобавитьПараметр(ВнешняяКоманда.ОбернутьВКавычки(ФайлТеста.ПолноеИмя));
		ВнешняяКоманда.ДобавитьПараметр("--mode");
		ВнешняяКоманда.ДобавитьПараметр("summary");
		ВнешняяКоманда.УстановитьРабочийКаталог(КаталогПроекта);
		ВнешняяКоманда.ПоказыватьВыводНемедленно(Ложь);

		КодВозврата = ВнешняяКоманда.Исполнить();

		Если КодВозврата <> 0 Тогда
			ВызватьИсключение "Тесты probes завершились с ошибкой: " + ФайлТеста.ПолноеИмя + Символы.ПС
				+ ВнешняяКоманда.ПолучитьВывод();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
