#Использовать autumn
#Использовать autumn-cli
#Использовать 1commands
#Использовать "src"

Детальки = Новый Соответствие;
Детальки.Вставить("cli.ИмяПриложения", "probes");
Детальки.Вставить("cli.ПолноеИмяПриложения", "Инструменты исследования ошибок OneScript");
Детальки.Вставить("cli.ВерсияПриложения", "0.1.0");

Совет = Новый СоветДругогоМастера;
Совет.ПолучитьСтроительМенеджераПараметров().ДобавитьПровайдерСоответствие(Детальки);

Поделка = Новый Поделка(Совет);
Поделка.ЗапуститьПриложение();
